In [32]:
import pandas as pd
import numpy as np

In [33]:
dias = pd.date_range(start='20190101', periods=12)
dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [34]:
Pessoa = ['George', 'Victor', 'Lucas']
np.random.choice(Pessoa)

'George'

In [35]:
nome = []
gasto = []
for i in range(len(dias)):
    nome.append(np.random.choice(Pessoa))
    gasto.append(np.round(np.random.rand()*100, 2))
nome

['Victor',
 'Lucas',
 'George',
 'George',
 'Lucas',
 'George',
 'Lucas',
 'Victor',
 'Victor',
 'Victor',
 'George',
 'George']

In [36]:
gasto

[43.95,
 8.48,
 54.03,
 11.63,
 77.73,
 21.42,
 67.43,
 17.19,
 97.97,
 79.96,
 1.8,
 96.77]

In [37]:
data = pd.DataFrame({'Dia': dias, 'Pessoa': nome, 'Gasto': gasto})
data

          Dia  Pessoa  Gasto
0  2019-01-01  Victor  43.95
1  2019-01-02   Lucas   8.48
2  2019-01-03  George  54.03
3  2019-01-04  George  11.63
4  2019-01-05   Lucas  77.73
5  2019-01-06  George  21.42
6  2019-01-07   Lucas  67.43
7  2019-01-08  Victor  17.19
8  2019-01-09  Victor  97.97
9  2019-01-10  Victor  79.96
10 2019-01-11  George   1.80
11 2019-01-12  George  96.77

In [55]:
data.groupby(['Pessoa'])['Gasto'].sum()

Pessoa
George    185.65
Lucas     153.64
Victor    239.07
Name: Gasto, dtype: float64

#### Pivot

In [40]:
pivotado = data.pivot(index='Dia', columns='Pessoa', values='Gasto').fillna(0)
pivotado

Pessoa      George  Lucas  Victor
Dia
2019-01-01    0.00   0.00   43.95
2019-01-02    0.00   8.48    0.00
2019-01-03   54.03   0.00    0.00
2019-01-04   11.63   0.00    0.00
2019-01-05    0.00  77.73    0.00
2019-01-06   21.42   0.00    0.00
2019-01-07    0.00  67.43    0.00
2019-01-08    0.00   0.00   17.19
2019-01-09    0.00   0.00   97.97
2019-01-10    0.00   0.00   79.96
2019-01-11    1.80   0.00    0.00
2019-01-12   96.77   0.00    0.00

#### Pivot Table

In [56]:
Carros = [7,4,3,2,8]
dias = pd.date_range('20190101','20190101',periods=5)
vendedor = ['George', 'Vagner', 'Pedro', 'Vagner', 'George']

df = pd.DataFrame({'Vendas': Carros, 'Data': dias, 'Vendedor': vendedor})
df

   Vendas       Data Vendedor
0       7 2019-01-01   George
1       4 2019-01-01   Vagner
2       3 2019-01-01    Pedro
3       2 2019-01-01   Vagner
4       8 2019-01-01   George

In [63]:
#pd.pivot(df, index='Vendedor', columns='Data', values='Vendas')
#pd.pivot_table(df, index='Vendedor', columns='Data', values='Vendas')
pd.pivot_table(df, index='Data', columns='Vendedor', values='Vendas', aggfunc='sum')

Vendedor    George  Pedro  Vagner
Data
2019-01-01      15      3       6